Repository: common-repository/mobcard-woo-payment-gateway
Catalog: languages/mobilpay-*.po
Languages: ro_ro

source: Continue to mobilPay
ro_ro: Continuă la mobilPay

source: Enable/Disable
ro_ro: Activează/Dezactivează

source: Enable mobilPay Card
ro_ro: Activează mobilPay Card

source: Title
ro_ro: Titlu

source: This controls the title which the user sees during checkout.
ro_ro: Titlul opţiunii de plată afişat clientului în pagina de finalizare comandă.

source: Credit/Debit Card
ro_ro: Card de credit/debit

source: Description
ro_ro: Descriere

source: This controls the description which the user sees during checkout.
ro_ro: Descrierea opţiunii de plată afişat clientului în pagina de finalizare comandă.

source: Pay with your credit/debit card via mobilPay 3D Secure gateway.
ro_ro: Plăteşte cu cardul de credit/debit prin mobilPay 3D Secure.

source: Merchant ID
ro_ro: ID comerciant

source: Unique key assigned to your mobilPay merchant account for the payment process.
ro_ro: Cheia unică asociată contului tău de comerciant mobilPay necesară procesului de plată.

source: Enable mobilPay sandbox
ro_ro: Activează mobilPay sandbox

source: The mobilPay sandbox environment can be used to test payments.
ro_ro: Sandbox mobilPay este un mediu de testare a plăţilor.

source: To complete your order please make the payment.
ro_ro: Pentru a finaliza comanda vă rugăm să efectuaţi plata.

source: Payment failed.
ro_ro: Plată eşuată.

source: Pay for order
ro_ro: Plăteşte pentru comandă

source: Credit/debit card payment via mobilPay
ro_ro: Plata cu cardul de credit/debit prin mobilPay

source: Redirecting to mobilPay 3D Secure payment gateway to make the payment.
ro_ro: Redirecţionare către portalul mobilPay 3D Secure pentru efectuarea plăţii.

source: Cancel order
ro_ro: Anulează comanda

source: Settings
ro_ro: Setări
